tests/fixtures/wallet_transaction.json

{
  "wallet_transactions": [
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac1111",
      "lago_wallet_id": "12345",
      "lago_invoice_id":"invoice-uuid-1111",
      "lago_voided_invoice_id": "voided-invoice-uuid-1111",
      "status": "settled",
      "source": "manual",
      "transaction_status": "purchased",
      "transaction_type": "inbound",
      "amount": "10",
      "credit_amount": "10",
      "remaining_amount_cents": 5000,
      "remaining_credit_amount": "50.0",
      "settled_at": "2022-04-29T08:59:51Z",
      "created_at": "2022-04-29T08:59:51Z",
      "name": "Transaction Name",
      "payment_method": {
        "payment_method_type": "card",
        "payment_method_id": "pm_123"
      }
    },
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac1222",
      "lago_wallet_id": "12345",
      "lago_invoice_id":"invoice-uuid-2222",
      "lago_voided_invoice_id": "voided-invoice-uuid-2222",
      "status": "settled",
      "source": "manual",
      "transaction_status": "purchased",
      "transaction_type": "inbound",
      "amount": "10",
      "credit_amount": "10",
      "remaining_amount_cents": 5000,
      "remaining_credit_amount": "50.0",
      "settled_at": "2022-04-29T08:59:51Z",
      "created_at": "2022-04-29T08:59:51Z",
      "name": "Transaction Name",
      "payment_method": {
        "payment_method_type": "card",
        "payment_method_id": "pm_123"
      }
    },
    {
      "lago_id": "b7ab2926-1de8-4428-9bcd-779314ac1333",
      "lago_wallet_id": "12345",
      "lago_invoice_id": null,
      "lago_voided_invoice_id": null,
      "status": "failed",
      "source": "manual",
      "transaction_status": "purchased",
      "transaction_type": "inbound",
      "amount": "10",
      "credit_amount": "10",
      "remaining_amount_cents": 5000,
      "remaining_credit_amount": "50.0",
      "settled_at": "2022-04-29T08:59:51Z",
      "failed_at": "2022-04-29T08:59:51Z",
      "created_at": "2022-04-29T08:59:51Z",
      "name": "Transaction Name",
      "payment_method": {
        "payment_method_type": "card",
        "payment_method_id": "pm_123"
      }
    }
  ]
}
